/**
 * @Description: 配置项
 * @author Amos
 * @date 2020/9/21
*/
const data = [
  {
    params: 'print',
    info: '是否打印(必填)',
    type: 'boolean',
    optional: 'true、false',
    default: 'false'
  },
  {
    params: 'callback',
    info: '回调函数(必填)',
    type: 'function',
    optional: '—',
    default: '—'
  },
  {
    params: 'format',
    info: '纸张大小，可以用a1或其他等纸张的字符串，也可以穿自定义数组，结合长度单位来传参。',
    type: '[array, string]',
    optional: '"a0": [2383.94, 3370.39],"a1": [1683.78, 2383.94],"a2": [1190.55, 1683.78],"a3": [841.89, 1190.55],"a4": [595.28, 841.89],"a5": [419.53, 595.28],"a6": [297.64, 419.53],"a7": [209.76, 297.64],"a8": [147.40, 209.76],"a9": [104.88, 147.40],"a10": [73.70, 104.88],"b0": [2834.65, 4008.19],"b1": [2004.09, 2834.65],"b2": [1417.32, 2004.09],"b3": [1000.63, 1417.32],"b4": [708.66, 1000.63],"b5": [498.90, 708.66],"b6": [354.33, 498.90],"b7": [249.45, 354.33],"b8": [175.75, 249.45],"b9": [124.72, 175.75],"b10": [87.87, 124.72],"c0": [2599.37, 3676.54],"c1": [1836.85, 2599.37],"c2": [1298.27, 1836.85],"c3": [918.43, 1298.27],"c4": [649.13, 918.43],"c5": [459.21, 649.13],"c6": [323.15, 459.21],"c7": [229.61, 323.15],"c8": [161.57, 229.61],"c9": [113.39, 161.57],"c10": [79.37, 113.39],"dl": [311.81, 623.62],"letter": [612, 792],"government-letter": [576, 756],"legal": [612, 1008],"junior-legal": [576, 360],"ledger": [1224, 792],"tabloid": [792, 1224],"credit-card": [153, 243]，或者自定义数据[100,100]',
    default: '—'
  },
  {
    params: 'orientation',
    info: 'l横向，p纵向',
    type: 'string',
    optional: 'l、p',
    default: 'l'
  },
  {
    params: 'unit',
    info: '长度单位',
    type: 'string',
    optional: 'pt、mm、cm、in、px、pc、em、ex',
    default: 'in'
  }
]
export default data

